Tekla.Structures.Model.RebarGeometry.FromStruct(Tekla.Structures.ModelInternal.dotWire_t,System.Int32)
Internal method for transforming struct received over .NET interface into RebarGeometry class.
NOTE: The struct transfers several geometries at once in order to minimize overhead.
Therefore the struct does not correspond 1-to-1 to the RebarGeometry class.
DotWire: The struct from which rebar data is copied.
StructIndex: Index from which the copying is started

Tekla.Structures.Model.RebarGeometry.AddFromStruct(Tekla.Structures.ModelInternal.dotWire_t,System.Int32)
Internal method for transforming struct received over .NET interface into RebarGeometry class.
NOTE: The struct adds geometry to existing one at once in order to minimize overhead.
Therefore the struct does not correspond 1-to-1 to the RebarGeometry class.
DotWire: The struct from which rebar data is copied.
StructIndex: Index from which the copying is started